In [73]:
import pandas as pd

In [74]:
df0=pd.read_csv("../data/raw/bengaluru_house_prices.csv")
df0.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

# verifying and checking the Area type column

In [75]:
df0.area_type.value_counts()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

# encoding the availabilty as 0 and 1 by assuming the ready to move as 1 ,other dates as 0

In [76]:
df1=df0.copy()
df1=df1[~(df1.availability=="Immediate Possession")] #remove this catogery
df1.shape

(13304, 9)

In [77]:
df1["availability"]=df1.availability.apply(lambda x:1 if x.lower().strip()=="ready to move" else 0)
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

# make cleaning on size column and rename the column as BHK

In [78]:
df2=df1.copy()
df2.rename(columns={"size":"BHK"},inplace=True)
df2.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [79]:
df2.BHK.isnull().sum()

0

In [80]:
df2["BHK"]=df2.BHK.apply(lambda x:x.split()[0])

In [81]:
df2.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2,NaN,1200,2.0,1.0,51.00

# remove the society column

In [82]:
df3=df2.copy()
df3.head()

,area_type,availability,location,BHK,society,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2,NaN,1200,2.0,1.0,51.00

In [83]:
df3.drop("society",axis=1,inplace=True)

In [84]:
df3.head()

,area_type,availability,location,BHK,total_sqft,bath,balcony,price
0,Super built-up Area,0,Electronic City Phase II,2,1056,2.0,1.0,39.07
1,Plot Area,1,Chikka Tirupathi,4,2600,5.0,3.0,120.00
2,Built-up Area,1,Uttarahalli,3,1440,2.0,3.0,62.00
3,Super built-up Area,1,Lingadheeranahalli,3,1521,3.0,1.0,95.00
4,Super built-up Area,1,Kothanur,2,1200,2.0,1.0,51.00

# removing the balcony i think it doesnt impact on the price

In [85]:
df4=df3.drop("balcony",axis=1)

# check NAN value if then remove it

In [86]:
df5=df4.copy()
df5.isnull().sum()

area_type        0
availability     0
location         1
BHK              0
total_sqft       0
bath            57
price            0
dtype: int64

In [87]:
df5.dropna(subset=["bath","location"],inplace=True)
df5.isnull().sum()

area_type       0
availability    0
location        0
BHK             0
total_sqft      0
bath            0
price           0
dtype: int64

# clean the total sqft

In [88]:
df6=df5.copy()
df6.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [89]:
def convert_(X):
    
    try:
        return float(X)
    except:
        if len(X.split("-"))==2:
            arr=X.split("-")
            return (float(arr[0].strip())+float(arr[1].strip()))/2
        return None

In [90]:
df6["total_sqft"]=df6.total_sqft.apply(lambda x:convert_(x))
#and also remove the None rows
df6.dropna(subset="total_sqft",inplace=True)

# create a price per sqft price

In [91]:
df7=df6.copy()
df7["price_1_sqft"]=(df7.price/df7.total_sqft)*100000

In [92]:
df7.head()

,area_type,availability,location,BHK,total_sqft,bath,price,price_1_sqft
0,Super built-up Area,0,Electronic City Phase II,2,1056.0,2.0,39.07,3699.810606
1,Plot Area,1,Chikka Tirupathi,4,2600.0,5.0,120.00,4615.384615
2,Built-up Area,1,Uttarahalli,3,1440.0,2.0,62.00,4305.555556
3,Super built-up Area,1,Lingadheeranahalli,3,1521.0,3.0,95.00,6245.890861
4,Super built-up Area,1,Kothanur,2,1200.0,2.0,51.00,4250.000000

In [93]:
df7.isnull().sum()

area_type       0
availability    0
location        0
BHK             0
total_sqft      0
bath            0
price           0
price_1_sqft    0
dtype: int64

In [94]:
df7.shape

(13200, 8)

# encode the location and drop the one columns

In [95]:
df8=df7.copy()
df8["location"]=df8.location.apply(lambda x:x.lower().strip())

In [96]:
location_filter=df8.location.value_counts()

In [97]:
others=location_filter[location_filter<4]

In [98]:
df8["location"]=df8.location.apply(lambda x:"others" if x in others else x)

In [99]:
df8.location.value_counts()

location
others             1192
whitefield          533
sarjapur  road      392
electronic city     304
kanakpura road      264
                   ...
rwf west colony       4
bel road              4
t dasarahalli         4
hanumanth nagar       4
kammagondahalli       4
Name: count, Length: 518, dtype: int64

In [100]:
location_dummies=pd.get_dummies(df8.location).astype(int)
location_dummies.head()

,1st block hrbr layout,1st block jayanagar,1st block koramangala,1st phase jp nagar,1st stage indira nagar,2nd block hrbr layout,2nd block jayanagar,2nd phase jp nagar,2nd phase judicial layout,2nd stage nagarbhavi,...,vittasandra,volagerekallahalli,whitefield,wilson garden,yelachenahalli,yelahanka,yelahanka new town,yelenahalli,yemlur,yeshwanthpur
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [101]:
#drop the others
location_dummies.drop("others",axis=1,inplace=True)

# encode the dummies for the area_type

In [102]:
area_dummies=pd.get_dummies(df8.area_type).astype(int)
area_dummies.head()

   Built-up  Area  Carpet  Area  Plot  Area  Super built-up  Area
0               0             0           0                     1
1               0             0           1                     0
2               1             0           0                     0
3               0             0           0                     1
4               0             0           0                     1

In [103]:
# drop one column
area_dummies.drop("Carpet  Area",axis=1,inplace=True)

# concat all the dummies and original columns

In [104]:
df8.head()

,area_type,availability,location,BHK,total_sqft,bath,price,price_1_sqft
0,Super built-up Area,0,electronic city phase ii,2,1056.0,2.0,39.07,3699.810606
1,Plot Area,1,chikka tirupathi,4,2600.0,5.0,120.00,4615.384615
2,Built-up Area,1,uttarahalli,3,1440.0,2.0,62.00,4305.555556
3,Super built-up Area,1,lingadheeranahalli,3,1521.0,3.0,95.00,6245.890861
4,Super built-up Area,1,kothanur,2,1200.0,2.0,51.00,4250.000000

In [105]:
df9=pd.concat([df8[["availability","BHK","total_sqft","bath","price","price_1_sqft"]],location_dummies,area_dummies],axis=1)
df9.columns

Index(['availability', 'BHK', 'total_sqft', 'bath', 'price', 'price_1_sqft',
       '1st block hrbr layout', '1st block jayanagar', '1st block koramangala',
       '1st phase jp nagar',
       ...
       'wilson garden', 'yelachenahalli', 'yelahanka', 'yelahanka new town',
       'yelenahalli', 'yemlur', 'yeshwanthpur', 'Built-up  Area', 'Plot  Area',
       'Super built-up  Area'],
      dtype='object', length=526)

## convert it to csv file

In [106]:
df9.to_csv("../data/processed/processed_data.csv",index=True)

In [107]:
df10=pd.concat([df8[["location","availability","BHK","total_sqft","bath","price","price_1_sqft"]],location_dummies,area_dummies],axis=1)

In [108]:
df10.to_csv("../data/processed/processed_data_location.csv",index=True)